In [1]:
import pandas as pd

In [2]:
df = pd.Series([1, 2, 3, 4, 5])
df

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
df = pd.DataFrame([1,2,3,4,5])
df

   0
0  1
1  2
2  3
3  4
4  5

In [4]:
df = pd.read_csv("../users.csv")
df

   ID Username  Password            Email       Phone
0   3     Abhi   abhi123    xyz@gmail.com  9995600650
1   5    Kitty  kitty123  kitty@gmail.com  9876580987
2   6   Kimono    kim123    kim@yahoo.com   897650987

In [5]:
df = pd.Series({'A':1, 'B':2, 'C':3, 'D':4, 'E':5})
df

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [6]:
X = {'A':1, 'B':2, 'C':3, 'D':4, 'E':5}

df = pd.DataFrame(X, index=[0])
df

   A  B  C  D  E
0  1  2  3  4  5

In [7]:
df = pd.read_csv("sample.csv")
df

   Name Brand Model  number
0   BMW    B1   NaN  4545.0
1  Benz   NaN    w2  5645.0
2   NaN    A1    w3  8989.0
3   BMW    B1    w1     NaN
4  Benz   Be1    w2  3445.0
5   BMW    B1    w1    45.0
6  Benz   Be1   NaN  5656.0
7  Benz   Be1    w2  3445.0
8   BMW    B1    w1    45.0
9  Benz   Be1   NaN  5656.0

In [8]:
X={'A':[1,2,3,4,5], 'B':[6,7,8,9,10]}
df=pd.DataFrame(X)
df['B'].add(15)
# df

0    21
1    22
2    23
3    24
4    25
Name: B, dtype: int64

In [9]:
X={'A':[1,2,3,4,5], 'B':[6,7,8,9,10]}
df=pd.DataFrame(X)
df['B'] = df['B'].add(15)
df

   A   B
0  1  21
1  2  22
2  3  23
3  4  24
4  5  25

In [10]:
X={'A':[1,2,3,4,5], 'B':[6,7,8,9,10]}
df=pd.DataFrame(X)
df['C'] = df['B'].add(15)
df

   A   B   C
0  1   6  21
1  2   7  22
2  3   8  23
3  4   9  24
4  5  10  25

In [11]:
data = {
    'X':[50,40,30],
    'Y':[100.3,200.5,150.75],
   
}

df = pd.DataFrame(data)
print(df)
# df['C']=
df.sum(axis=0)
# df

    X       Y
0  50  100.30
1  40  200.50
2  30  150.75

X    120.00
Y    451.55
dtype: float64

In [12]:
data = {
    'A':[1,2,3,4,5],
    'B':[6,7,8,9,10]
}

df = pd.DataFrame(data)

df['C']=df['B'].pow(2)
df

   A   B    C
0  1   6   36
1  2   7   49
2  3   8   64
3  4   9   81
4  5  10  100

In [13]:
data={
    'A':[1,2,3,4,5],
    'B':[6,7,8,9,10]
}

df = pd.DataFrame(data)

df['C'] = df['B'].div(df['A'])

df

   A   B         C
0  1   6  6.000000
1  2   7  3.500000
2  3   8  2.666667
3  4   9  2.250000
4  5  10  2.000000

In [14]:
data={
    'A': [1,2,3,4,5],
    'B': [6,7,8,9,10]
}

df = pd.DataFrame(data)

df['C'] = df['A'].mul(df['B'])
df

   A   B   C
0  1   6   6
1  2   7  14
2  3   8  24
3  4   9  36
4  5  10  50

In [15]:
A = int(input("Enter the First Number: "))
B = int(input("Enter the Second Nummber: "))



# df = pd.DataFrame()

df= A * B
df
# df

16

In [16]:
data = {
    'A':[1,2,3,4,5],
    'B':[6,7,8,9,10]
    }

df = pd.DataFrame(data)

df['C'] = df['B'].sub(df['A'])
df

   A   B  C
0  1   6  5
1  2   7  5
2  3   8  5
3  4   9  5
4  5  10  5

In [17]:
data = [[10,20,30,40,50], [60,70,80,90,100], [110,120,130,140,150]]

df = pd.DataFrame(data)

print(df)

df.diff()

     0    1    2    3    4
0   10   20   30   40   50
1   60   70   80   90  100
2  110  120  130  140  150

      0     1     2     3     4
0   NaN   NaN   NaN   NaN   NaN
1  50.0  50.0  50.0  50.0  50.0
2  50.0  50.0  50.0  50.0  50.0

In [18]:
df = pd.read_csv("student_marks.csv")
# df['Total Marks'] = df[Maths].sum(df['Physics'])

# df['Total Marks'] = df['Maths'].add(df['Physics']).add(df['Chemistry']).add(df['English']).add(df['Biology']).add(df['Economics']).add(df['History']).add(df['Civics'])
# df['Average Marks 2'] = df['Total Marks'].div(8)
# X=df['Total Marks']
# X
df['Average Marks']=df.select_dtypes(include=['number']).mean(axis=1)
# df['Total Marks'] = df['Maths'].add(df['Physics']).add(df['Chemistry']).add(df['English']).add(df['Biology']).add(df['Economics']).add(df['History']).add(df['Civics'])

df['Total Marks'] = df.select_dtypes(include=['number']).sum(axis=1).sub(df['Average Marks'])

column ={'Unnamed: 0':'Student_Name'}
dd = df.rename(columns=column)
dd
x = dd.drop(['Gender','DOB'],axis=1)
x
# df
# df

,Student_Name,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics,Average Marks,Total Marks
0,John,55,45,56,87,21,52,89,65,58.750,470.0
1,Suresh,75,96,78,64,90,61,58,2,65.500,524.0
2,Ramesh,25,54,89,76,95,87,56,74,69.500,556.0
3,Jessica,78,96,86,63,54,89,75,45,73.250,586.0
4,Jennifer,58,96,78,46,96,77,83,53,73.375,587.0
5,Annu,45,87,52,89,55,89,87,52,69.500,556.0
6,pooja,55,64,61,58,75,58,64,61,62.000,496.0
7,Ritesh,54,76,87,56,25,56,76,87,64.625,517.0
8,Farha,55,63,89,75,78,75,63,89,73.375,587.0
9,Mukesh,96,46,77,83,58,83,46,77,70.750,566.0

In [19]:
df = pd.read_csv("car-sales-extended-missing-data.csv")
# df.dropna(inplace=False)
df.fillna(0,inplace=True)
df.to_excel("check.xlsx",index=False)

df

       Make Colour  Odometer (KM)  Doors    Price
0     Honda      0        35431.0    4.0  15323.0
1       BMW   Blue       192714.0    0.0  19943.0
2     Honda  White            0.0    4.0  28343.0
3    Toyota  White       154365.0    4.0      0.0
4    Nissan   Blue       181577.0    3.0  14043.0
..      ...    ...            ...    ...      ...
995  Toyota  Black        35820.0    4.0  32042.0
996       0  White       155144.0    3.0   5716.0
997  Nissan   Blue        66604.0    4.0  31570.0
998   Honda  White       215883.0    4.0   4001.0
999  Toyota   Blue       248360.0    4.0  12732.0

[1000 rows x 5 columns]

In [20]:
data = {
    'A': [10, 20, 30],
    'B': [40, 10, 5]
}
df=pd.DataFrame(data)
# df.diff()

df['C']=df['A'].diff()

df

    A   B     C
0  10  40   NaN
1  20  10  10.0
2  30   5  10.0

In [21]:
data = {'A':[10,20,30,40,50,60]}

df = pd.DataFrame(data)

median_value =df['A'].median()

median_value

np.float64(35.0)

In [22]:
data = {'A':[1,2,2,2,2,3,4,5,5,5,5,6,7]}
df = pd.DataFrame(data)

mode_value = df['A'].mode()
mode_value

0    2
1    5
Name: A, dtype: int64

In [23]:
df = pd.read_csv("car-sales-extended-missing-data.csv")

df.head(60)
df.tail(60)

       Make Colour  Odometer (KM)  Doors    Price
940   Honda  White        53474.0    4.0      NaN
941  Toyota    Red       166046.0    4.0   7955.0
942  Nissan   Blue       228192.0    4.0  12641.0
943  Toyota   Blue       221076.0    4.0   8786.0
944  Toyota  White        88224.0    4.0  24304.0
945     BMW    Red       156064.0    5.0  17105.0
946  Toyota  Green       132714.0    4.0  17076.0
947  Toyota   Blue        17609.0    4.0      NaN
948  Toyota  Black        43171.0    4.0  24354.0
949  Nissan   Blue        57558.0    3.0  16622.0
950   Honda  White        52414.0    4.0  11548.0
951   Honda  White       186495.0    4.0  14849.0
952  Nissan  White       136022.0    4.0      NaN
953     BMW  White       102773.0    5.0  29551.0
954  Toyota   Blue        92777.0    4.0  32509.0
955  Toyota    NaN       103682.0    4.0  10261.0
956  Toyota  Black        90508.0    4.0  33758.0
957  Nissan    NaN        39639.0    3.0  12315.0
958   Honda   Blue        26824.0    4.0  28422.0
959  Nissan  White       186786.0    4.0      NaN
960   Honda  White            NaN    4.0  13070.0
961  Toyota  White       239760.0    4.0   4896.0
962   Honda   Blue        96308.0    4.0  15010.0
963  Toyota  White       107043.0    4.0   7126.0
964  Toyota   Blue        39753.0    4.0  34231.0
965   Honda   Blue       168261.0    4.0  14691.0
966   Honda  Black        94941.0    4.0  27598.0
967     BMW  Green        26839.0    5.0  15224.0
968  Nissan  White       227278.0    4.0      NaN
969     BMW   Blue        45207.0    5.0  35254.0
970  Toyota   Blue       186309.0    4.0  16416.0
971     BMW  Black       178164.0    3.0  24891.0
972   Honda  White            NaN    4.0  17939.0
973   Honda  Green       237627.0    4.0   8430.0
974     NaN  White       155383.0    4.0  14345.0
975   Honda    NaN        22409.0    4.0  10429.0
976  Toyota   Blue        95317.0    4.0   7435.0
977  Toyota   Blue       128016.0    4.0  16835.0
978     BMW  White        85739.0    5.0  48419.0
979  Toyota  Black        17975.0    4.0  17940.0
980  Toyota   Blue       230314.0    4.0   6720.0
981  Toyota  White       129454.0    4.0   6446.0
982   Honda  White       238172.0    4.0  13273.0
983  Toyota    Red            NaN    4.0  14671.0
984  Nissan   Blue       157235.0    4.0   4196.0
985     NaN   Blue       216250.0    4.0   9691.0
986   Honda  White        71934.0    4.0  26882.0
987   Honda  White       215235.0    4.0   3825.0
988  Nissan  Black       248736.0    4.0   8358.0
989  Toyota    Red        41735.0    4.0  13928.0
990  Toyota  White       173408.0    4.0   8082.0
991   Honda   Blue       235985.0    4.0   9184.0
992   Honda  Green        54721.0    4.0  27419.0
993  Nissan  Black       162523.0    4.0   4696.0
994     BMW   Blue       163322.0    3.0  31666.0
995  Toyota  Black        35820.0    4.0  32042.0
996     NaN  White       155144.0    3.0   5716.0
997  Nissan   Blue        66604.0    4.0  31570.0
998   Honda  White       215883.0    4.0   4001.0
999  Toyota   Blue       248360.0    4.0  12732.0

In [24]:
df = pd.read_csv("car-sales-extended-missing-data.csv")
df.dropna(subset=["Colour","Odometer (KM)","Doors"],inplace=True)
df.fillna({"Make": "Unknown", "Price": "YTD"},inplace=True) # For mentioned column having null values
# df.fillna("YTD",inplace=True) #For whole column with null values
df.loc[df['Make']=='Toyota', 'Make'] = 'Ambassodor'

df

# df

           Make Colour  Odometer (KM)  Doors    Price
3    Ambassodor  White       154365.0    4.0      YTD
4        Nissan   Blue       181577.0    3.0  14043.0
5         Honda    Red        42652.0    4.0  23883.0
6    Ambassodor   Blue       163453.0    4.0   8473.0
8       Unknown  White       130538.0    4.0   9374.0
..          ...    ...            ...    ...      ...
995  Ambassodor  Black        35820.0    4.0  32042.0
996     Unknown  White       155144.0    3.0   5716.0
997      Nissan   Blue        66604.0    4.0  31570.0
998       Honda  White       215883.0    4.0   4001.0
999  Ambassodor   Blue       248360.0    4.0  12732.0

[855 rows x 5 columns]

In [25]:
df = pd.read_csv("car-sales-extended-missing-data.csv")

df.add_prefix('Car_',axis=1)
df.add_suffix('')

# df

       Make Colour  Odometer (KM)  Doors    Price
0     Honda    NaN        35431.0    4.0  15323.0
1       BMW   Blue       192714.0    NaN  19943.0
2     Honda  White            NaN    4.0  28343.0
3    Toyota  White       154365.0    4.0      NaN
4    Nissan   Blue       181577.0    3.0  14043.0
..      ...    ...            ...    ...      ...
995  Toyota  Black        35820.0    4.0  32042.0
996     NaN  White       155144.0    3.0   5716.0
997  Nissan   Blue        66604.0    4.0  31570.0
998   Honda  White       215883.0    4.0   4001.0
999  Toyota   Blue       248360.0    4.0  12732.0

[1000 rows x 5 columns]

In [28]:
df = pd.DataFrame({
    'Name': ['BMW', None, 'Audi', None],
    'Price': [5000, 6000, None, 45000]
})

df
# Replace 'BMW' with 'X5'
df['Name'] = df['Name'].replace('BMW', 'X5')
# df
print(df)

   Name    Price
0    X5   5000.0
1  None   6000.0
2  Audi      NaN
3  None  45000.0